package ru.sqltrainer.sql_trainer.tasks.where;

/**
 * 1.13. Предложение WHERE с оператором LIKE 3
 *
 * Для того, чтобы выбрать строки, которые удовлетворяют заданному условию,
 * в SQL используется WHERE предложение.
 *
 * При этом иногда необходимо сделать выборку строк чтобы при проверке условия
 * значение в столбце соответствовало какому-то интересующему нас шаблону.
 * В этом случае используется оператор LIKE. Также используется символ "_" -
 * он соответствует в точности одному любому символу.
 * Синтаксис будет выглядеть следующим образом (указан лишь пример):
 * SELECT имена_столбцов_через_запятую FROM название_таблицы
 * WHERE столбец_для_проверки LIKE '__подстрока%';
 * Т.е. если разбирать этот шаблон, то искомая строка должна начинаться с 2 символов,
 * после которых следует искомая подстрока, а дальше - любой набор символов.
 *
 * Для представленной ниже схемы airplanes напишите запрос, который вернет строки,
 * в которых в столбце model будет строка которая начинается гарантировано из трех любых символов,
 * дальше идет буква 'b' и далее - любой набор символов.
 *
 * Схема:
 * CREATE TABLE airplanes(
 *     id int not null primary key,
 *     model text,
 *     range int,
 *     capacity int
 * );
 */
public class Where14LikePattern {

    public String query() {
        return """
                SELECT
                """;
    }
}
