package ru.sqltrainer.sql_trainer.tasks.where;

/**
 * 17. Предложение WHERE с оператором BETWEEN и LIKE
 *
 * Для того, чтобы выбрать строки, которые удовлетворяют заданному условию,
 * в SQL используется WHERE предложение.
 *
 * При этом иногда необходимо сделать выборку строк чтобы при проверке условия
 * значение в столбце находилось в каком-то диапазоне значений.
 * В этом случае нам поможет оператор BETWEEN.
 *
 * При этом важно понимать, что если значение в столбце для проверки больше или равно значению_1
 * и меньше или равно значению_2, то логическое выражение вернет true.
 *
 * Для представленной ниже схемы напишите запрос, который вернет только те строки,
 * в которых значения в столбце first_name начинается с подстроки An,
 * и длина всей строки в это столбце находится в пределах от 3 до 5 символов
 * (используйте функцию length()).
 *
 * Схема:
 * CREATE TABLE customers(
 *     id int not null primary key,
 *     first_name text,
 *     last_name text,
 *     active boolean,
 *     email text
 * );
 */
public class Where18BetweenAndLike {

    public String query() {
        return """
                SELECT
                """;
    }
}
