package ru.sqltrainer.sql_trainer.tasks.where;

/**
 * 16. Предложение WHERE с оператором BETWEEN
 *
 * Для того, чтобы выбрать строки, которые удовлетворяют заданному условию,
 * в SQL используется WHERE предложение.
 *
 * При этом иногда необходимо сделать выборку строк чтобы при проверке условия
 * значение в столбце находилось в каком-то диапазоне значений.
 * В этом случае нам поможет оператор BETWEEN. Синтаксис будет иметь следующий вид:
 * SELECT имена_столбцов_через_запятую FROM название_таблицы
 * WHERE столбец_для_проверки BETWEEN значение_1 AND значение_2;
 *
 * Для представленной ниже схемы напишите запрос, который вернет только те транзакции,
 * значение поле в amount находится в пределах от 100 до 200.
 * В выборке должны быть отражены значения всех столбцов.
 *
 * Схема:
 * CREATE TABLE transactions(
 *     id int not null primary key,
 *     purpose text,
 *     client_id int,
 *     amount int,
 *     payment_date timestamp
 * );
 */
public class Where17Between {

    public String query() {
        return """
                SELECT
                """;
    }
}
