package ru.sqltrainer.sql_trainer.tasks.where;

/**
 * 1.11. Предложение WHERE с оператором LIKE 1
 *
 * Для того, чтобы выбрать строки, которые удовлетворяют заданному условию,
 * в SQL используется WHERE предложение.
 *
 * При этом иногда необходимо сделать выборку строк чтобы при проверке условия
 * значение в столбце соответствовало какому-то интересующему нас шаблону.
 * В этом случае используется оператор LIKE. Этот оператор используется вместе с символом "%" -
 * он соответствует любой последовательности символов, вместо него могут быть подставлены
 * любые символы в любом количестве, а может быть не подставлено ни одного символа.
 * Синтаксис будет выглядеть следующим образом:
 * SELECT имена_столбцов_через_запятую FROM название_таблицы
 * WHERE столбец_для_проверки LIKE 'подстрока%';
 *
 * Для представленной ниже схемы airplanes необходимо выполнить запрос,
 * который вернет все строки, у которых в поле model содержится строка которая начинается с Airbus.
 *
 * Схема:
 * CREATE TABLE airplanes(
 *     id int not null primary key,
 *     model text,
 *     range int,
 *     capacity int
 * );
 */
public class Where12LikePrefix {

    public String query() {
        return """
                SELECT
                """;
    }
}
