package ru.sqltrainer.sql_trainer.tasks.where;

/**
 * 1.8. Предложение WHERE с несколькими условиями с помощью OR 2
 *
 * Для того, чтобы выбрать строки, которые удовлетворяют заданному условию,
 * в SQL используется WHERE предложение.
 *
 * При этом условия можно комбинировать и проверять несколько условий.
 * Для этого используется логическая операция OR (ИЛИ). Синтаксис имеет следующий вид:
 * SELECT имена_столбцов_через_запятую FROM название_таблицы
 * WHERE условие1 OR условие2 OR условие3;
 * В итоге запрос вернет только те строки, удовлетворяющих хотя бы одному из условий,
 * которые объединены с помощью OR.
 *
 * Для представленной ниже схемы transactions напишите запрос, который выполнит выборку всех записей,
 * удовлетворяющих хотя бы одному из условий - значение в столбце purpose равно 'Credit'
 * или сумма amount больше 170 усл. ед.
 *
 * Схема:
 * CREATE TABLE transactions(
 *     id int not null primary key,
 *     purpose text,
 *     client_id int,
 *     amount int,
 *     payment_date timestamp
 * );
 */
public class Where09OrPurposeAmount {

    public String query() {
        return """
                SELECT
                """;
    }
}
