package ru.sqltrainer.sql_trainer.tasks.where;

/**
 * 1.9. Предложение WHERE с оператором IN
 *
 * Для того, чтобы выбрать строки, которые удовлетворяют заданному условию,
 * в SQL используется WHERE предложение.
 *
 * Если мы хотим сопоставить строку с любой строкой в списке мы можем использовать оператор IN.
 * Синтаксис будет следующим:
 * SELECT имена_столбцов_через_запятую FROM название_таблицы
 * WHERE столбец_для_проверки IN (строка1, строка2, и т.д.);
 * Если значение в проверяемом столбце совпадет с любой из строк в операторе IN,
 * то такая строка попадет в результаты выборки.
 *
 * Для представленной ниже схемы напишите запрос, который вернет только те строки,
 * у которых в столбце first_name будут строки Ann, Anne, Annie.
 *
 * Схема:
 * CREATE TABLE customers(
 *     id int not null primary key,
 *     first_name text,
 *     last_name text,
 *     active boolean,
 *     email text
 * );
 */
public class Where10InNames {

    public String query() {
        return """
                SELECT
                """;
    }
}
