package ru.sqltrainer.sql_trainer.tasks.where;

/**
 * 1.7. Предложение WHERE с несколькими условиями с помощью OR 1
 *
 * Для того, чтобы выбрать строки, которые удовлетворяют заданному условию,
 * в SQL используется WHERE предложение.
 *
 * При этом условия можно комбинировать и проверять несколько условий.
 * Для этого используется логическая операция OR (ИЛИ). Синтаксис имеет следующий вид:
 * SELECT имена_столбцов_через_запятую FROM название_таблицы
 * WHERE условие1 OR условие2 OR условие3;
 * В итоге запрос вернет только те строки, удовлетворяющих хотя бы одному из условий,
 * которые объединены с помощью OR.
 *
 * Для представленной ниже схемы customers напишите запрос, который выполнит выборку всех записей,
 * удовлетворяющих хотя бы одному из условий - значение в столбце id больше 3
 * или значение в столбце active равно false.
 *
 * Схема:
 * CREATE TABLE customers(
 *     id int not null primary key,
 *     first_name text,
 *     last_name text,
 *     active boolean,
 *     email text
 * );
 */
public class Where08OrConditions {

    public String query() {
        return """
                SELECT
                """;
    }
}
