package ru.sqltrainer.sql_trainer.tasks.where;

/**
 * 1.12. Предложение WHERE с оператором LIKE 2
 *
 * Для того, чтобы выбрать строки, которые удовлетворяют заданному условию,
 * в SQL используется WHERE предложение.
 *
 * При этом иногда необходимо сделать выборку строк чтобы при проверке условия
 * значение в столбце соответствовало какому-то интересующему нас шаблону.
 * В этом случае используется оператор LIKE. Этот оператор используется вместе с символом "%" -
 * он соответствует любой последовательности символов.
 * Синтаксис будет выглядеть следующим образом:
 * SELECT имена_столбцов_через_запятую FROM название_таблицы
 * WHERE столбец_для_проверки LIKE '%подстрока';
 * Шаблон в операторе LIKE всегда покрывает всю анализируемую строку.
 *
 * Для представленной ниже схемы airplanes напишите запрос, который вернет все строки
 * у которой в столбце model будет в конце строки последовательность символов 200.
 *
 * Схема:
 * CREATE TABLE airplanes(
 *     id int not null primary key,
 *     model text,
 *     range int,
 *     capacity int
 * );
 */
public class Where13LikeSuffix {

    public String query() {
        return """
                SELECT
                """;
    }
}
