package ru.sqltrainer.sql_trainer.tasks.where;

/**
 * 1.4. Предложение WHERE 4
 *
 * Для того, чтобы выбрать строки, которые удовлетворяют заданному условию,
 * в SQL используется WHERE предложение.
 *
 * Синтаксис имеет следующий вид:
 * SELECT имена_столбцов_через_запятую FROM название_таблицы
 * WHERE условие ORDER BY условие_сортировки
 * ORDER BY в данном случае опциональное предложение, указывать необязательно.
 *
 * В итоге запрос возвращает только те строки, которые удовлетворяют условию в WHERE.
 *
 * Для формирования условия в WHERE предложении также можно использовать оператор сравнения
 * НЕ РАВНО - при этом обозначить его можно 2-мя способами - != и &lt;&gt;.
 *
 * Важная особенность - WHERE оценивается после FROM, но перед SELECT и ORDER BY.
 * Поэтому если используются псевдонимы в SELECT, то мы не можем использовать их в WHERE.
 *
 * Для представленной ниже схемы customers напишите запрос, который выполнит выборку всех записей,
 * которые удовлетворяют условию - длина строки в столбце last_name должно быть не равно 8.
 *
 * Схема:
 * CREATE TABLE customers(
 *     id int not null primary key,
 *     first_name text,
 *     last_name text,
 *     active boolean,
 *     email text
 * );
 */
public class Where05LengthNotEqual {

    public String query() {
        return """
                SELECT
                """;
    }
}
