package ru.sqltrainer.sql_trainer.tasks.where;

/**
 * 1.2. Предложение WHERE 2
 *
 * Для того, чтобы выбрать строки, которые удовлетворяют заданному условию,
 * в SQL используется WHERE предложение.
 *
 * Синтаксис имеет следующий вид:
 * SELECT имена_столбцов_через_запятую FROM название_таблицы
 * WHERE условие ORDER BY условие_сортировки
 * ORDER BY в данном случае опциональное предложение, указывать необязательно.
 *
 * В итоге запрос возвращает только те строки, которые удовлетворяют условию в WHERE.
 *
 * Для формирования условия в WHERE предложении используются операторы сравнения: >, &lt;, >=, &lt;=.
 *
 * Для представленной ниже схемы напишите запрос, который выполнит выборку всех записей,
 * которые удовлетворяют условию - длина строки в столбце first_name должна быть строго больше 4.
 * Для того чтобы получить длину строки используйте функцию length(название_столбца).
 *
 * Схема:
 * CREATE TABLE customers(
 *     id int not null primary key,
 *     first_name text,
 *     last_name text,
 *     active boolean,
 *     email text
 * );
 */
public class Where03LengthGreater {

    public String query() {
        return """
                SELECT
                """;
    }
}
