package ru.sqltrainer.sql_trainer.tasks.where;

/**
 * 1.15. Предложение WHERE с оператором NOT LIKE и предложением LIMIT
 *
 * Для того, чтобы выбрать строки, которые удовлетворяют заданному условию,
 * в SQL используется WHERE предложение.
 *
 * При этом иногда необходимо сделать выборку строк чтобы при проверке условия
 * значение в столбце не соответствовало какому-то интересующему нас шаблону.
 * В этом случае используется оператор NOT LIKE.
 *
 * При этом чтобы ограничить количество строк в выборке используется предложение LIMIT,
 * которое указывается в конце запроса и после него указывается количество строк,
 * которое должно попасть в результаты выборки.
 *
 * Для представленной ниже схемы airplanes напишите запрос, который вернет только те строки,
 * в которых в столбце model не содержится подстрока Airbus и Boeing.
 * Ограничить результаты выборки необходимо одной строкой.
 *
 * Схема:
 * CREATE TABLE airplanes(
 *     id int not null primary key,
 *     model text,
 *     range int,
 *     capacity int
 * );
 */
public class Where16NotLikeLimit {

    public String query() {
        return """
                SELECT
                """;
    }
}
