package ru.sqltrainer.sql_trainer.tasks.where;

/**
 * 18. Предложение WHERE с оператором BETWEEN: замена на логическое выражение
 *
 * Для того, чтобы выбрать строки, которые удовлетворяют заданному условию,
 * в SQL используется WHERE предложение.
 *
 * При этом иногда необходимо сделать выборку строк чтобы при проверке условия
 * значение в столбце находилось в каком-то диапазоне значений.
 * В этом случае нам поможет оператор BETWEEN.
 *
 * Необходимо отметить, если значение в столбце для проверки больше или равно значению_1
 * и меньше или равно значению_2, то логическое выражение вернет true.
 *
 * Таким образом оператор BETWEEN можно заменить на использование обычных логических выражений:
 * SELECT имена_столбцов FROM название_таблицы
 * WHERE столбец_для_проверки >= значение_1 AND столбец_для_проверки &lt;= значение_2;
 *
 * Для представленной ниже схемы напишите запрос, который вернет только те строки,
 * в которых значения в столбце grade больше или равно 65 и меньше или равно 80.
 * Не используйте в запросе BETWEEN.
 *
 * Схема:
 * CREATE TABLE subjects(
 *     id int not null primary key,
 *     name text,
 *     grade int,
 *     start_date timestamp
 * );
 */
public class Where19BetweenAsCompare {

    public String query() {
        return """
                SELECT
                """;
    }
}
