package ru.sqltrainer.sql_trainer.tasks.where;

/**
 * 19. Предложение WHERE с оператором NOT BETWEEN
 *
 * Для того, чтобы выбрать строки, которые удовлетворяют заданному условию,
 * в SQL используется WHERE предложение.
 *
 * При этом иногда необходимо сделать выборку строк, чтобы при проверке условия
 * значение в столбце было вне пределов диапазона значений.
 * В этом случае нам поможет оператор NOT BETWEEN. Синтаксис будет иметь следующий вид:
 * SELECT имена_столбцов_через_запятую FROM название_таблицы
 * WHERE столбец_для_проверки NOT BETWEEN значение_1 AND значение_2;
 *
 * Необходимо подчеркнуть, что если значение в столбце для проверки меньше значения_1
 * или больше значения_2, то логическое выражение вернет true и такие строки попадут в выборку.
 *
 * Соответственно запрос без BETWEEN можно переписать следующим образом:
 * SELECT имена_столбцов FROM название_таблицы
 * WHERE столбец_для_проверки &lt; значение_1 OR столбец_для_проверки > значение_2;
 *
 * Для представленной ниже схемы, напишите запрос, который вернет только те строки,
 * в которых значение в столбце amount не находится в пределах от 100 до 200.
 * Используйте NOT BETWEEN.
 *
 * Схема:
 * CREATE TABLE transactions(
 *     id int not null primary key,
 *     purpose text,
 *     client_id int,
 *     amount int,
 *     payment_date timestamp
 * );
 */
public class Where20NotBetween {

    public String query() {
        return """
                SELECT
                """;
    }
}
