package ru.sqltrainer.sql_trainer.tasks.where;

/**
 * 1.14. Предложение WHERE с оператором NOT LIKE
 *
 * Для того, чтобы выбрать строки, которые удовлетворяют заданному условию,
 * в SQL используется WHERE предложение.
 *
 * При этом иногда необходимо сделать выборку строк чтобы при проверке условия
 * значение в столбце не соответствовало какому-то интересующему нас шаблону.
 * В этом случае используется оператор NOT LIKE.
 * Синтаксис будет выглядеть следующим образом (указан лишь пример):
 * SELECT имена_столбцов_через_запятую FROM название_таблицы
 * WHERE столбец_для_проверки NOT LIKE 'подстрока%';
 *
 * Для представленной ниже схемы airplanes напишите запрос, который вернет только те строки,
 * в которых в столбце model не содержится подстрока Airbus и Boeing.
 *
 * Схема:
 * CREATE TABLE airplanes(
 *     id int not null primary key,
 *     model text,
 *     range int,
 *     capacity int
 * );
 */
public class Where15NotLike {

    public String query() {
        return """
                SELECT
                """;
    }
}
