package ru.sqltrainer.sql_trainer.tasks.where;

/**
 * 1.1. Предложение WHERE 1
 *
 * Для того, чтобы выбрать строки, которые удовлетворяют заданному условию,
 * в SQL используется WHERE предложение.
 *
 * Синтаксис имеет следующий вид:
 * SELECT имена_столбцов_через_запятую FROM название_таблицы
 * WHERE условие ORDER BY условие_сортировки
 * ORDER BY в данном случае опциональное предложение, указывать необязательно.
 *
 * Условие должно оцениваться как истина, ложь или неизвестность.
 * Это может быть логическое выражение или комбинация логических выражений.
 *
 * В итоге запрос возвращает только те строки, которые удовлетворяют условию в WHERE.
 *
 * Для представленной ниже схемы customers напишите запрос, который вернет только те записи,
 * у которых значение в столбце active равно true.
 *
 * Схема:
 * CREATE TABLE customers(
 *     id int not null primary key,
 *     first_name text,
 *     last_name text,
 *     active boolean,
 *     email text
 * );
 */
public class Where02ActiveTrue {

    public String query() {
        return """
                SELECT
                """;
    }
}
